In [2]:
import pandas as pd
import numpy as np

In [39]:
d1 = pd.DataFrame(np.random.randint(30,size=(3,3)),columns=['a','b','c']) 
d1

    a   b   c
0  18   1   0
1  16  25  28
2  21   9  22

In [40]:
d2 = pd.DataFrame(np.random.randint(30,size=(3,3)),columns=['p','q','r']) 
d2

    p   q   r
0  24   5  12
1  23  14  29
2  11   9   7

In [42]:
d2.drop("p",axis=1)

    q   r
0   5  12
1  14  29
2   9   7

In [41]:
pd.concat([d1,d2])

      a     b     c     p     q     r
0  18.0   1.0   0.0   NaN   NaN   NaN
1  16.0  25.0  28.0   NaN   NaN   NaN
2  21.0   9.0  22.0   NaN   NaN   NaN
0   NaN   NaN   NaN  24.0   5.0  12.0
1   NaN   NaN   NaN  23.0  14.0  29.0
2   NaN   NaN   NaN  11.0   9.0   7.0

In [27]:
d3 = pd.DataFrame(np.random.randint(30,size=(3,3)),index=['a','b','c']) 
d3

    0   1   2
a   0   6   5
b  10   0  24
c  13  27  16

In [28]:
pd.concat([d1,d2,d3],axis=1)

    0   1   2   0   1   2   0   1   2
a  24   5   1  17   8  28   0   6   5
b  23  29  25  18   7  15  10   0  24
c   7   3  17  23  12  25  13  27  16

In [46]:
df1 = pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8],'c':[1,6,4,6]})
df1

   a  b  c
0  1  5  1
1  2  6  6
2  3  7  4
3  4  8  6

In [56]:
df2 = pd.DataFrame({'a':[0,7,3,5],'b':[5,6,7,8],'d':[1,0,4,6]})
df2

   a  b  d
0  0  5  1
1  7  6  0
2  3  7  4
3  5  8  6

In [61]:
pd.merge(df1,df2,on='b',how="left")

   a_x  b  c  a_y  d
0    1  5  1    0  1
1    2  6  6    7  0
2    3  7  4    3  4
3    4  8  6    5  6

In [62]:
df1

   a  b  c
0  1  5  1
1  2  6  6
2  3  7  4
3  4  8  6

In [68]:
for i in df1.interpolate():
    print(df1[i])

0    1
1    2
2    3
3    4
Name: a, dtype: int64
0    5
1    6
2    7
3    8
Name: b, dtype: int64
0    1
1    6
2    4
3    6
Name: c, dtype: int64

In [95]:
idx = pd.date_range('7/8/2018',periods=4,freq='ME')

In [96]:
idx

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31'], dtype='datetime64[ns]', freq='ME')

In [97]:
idx

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31'], dtype='datetime64[ns]', freq='ME')

In [98]:
new = pd.DatetimeIndex(idx)
new

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31'], dtype='datetime64[ns]', freq='ME')

In [115]:
a = df1.reset_index()

In [123]:
a = pd.DataFrame([1,2,3,4])

In [125]:
a.reset_index()

   index  0
0      0  1
1      1  2
2      2  3
3      3  4

In [128]:
a.index=new
a.reset_index()

       index  0
0 2018-07-31  1
1 2018-08-31  2
2 2018-09-30  3
3 2018-10-31  4

In [130]:
a.resample(rule="M").mean()

C:\Users\Admin\AppData\Local\Temp\ipykernel_22768\934162635.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  a.resample(rule="M").mean()

              0
2018-07-31  1.0
2018-08-31  2.0
2018-09-30  3.0
2018-10-31  4.0

In [87]:
new

           0
a 2018-07-31
b 2018-08-31
c 2018-09-30
d 2018-10-31
e 2018-11-30

In [88]:
new.max()

0   2018-11-30
dtype: datetime64[ns]

In [ ]:
new.